evaluation/openfire/tsung-chat-update-mini.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="info">
  <clients>
	<client host="localhost" cpu="3"/>
  </clients>
  <servers>
	<server host="localhost" port="5222" type="tcp"></server>
  </servers>
  <load>
	<arrivalphase phase="1" duration="30" unit="second">
<!--	<arrivalphase phase="1" duration="2" unit="second">-->
      <users arrivalrate="5" unit="second"></users>
	</arrivalphase>
  </load>
  <options>
	<option type="ts_jabber" name="userid_max" value="10000"/>
	<option type="ts_jabber" name="username" value="testuser"/>
	<option type="ts_jabber" name="passwd" value="testpassword"/>
	<option name="file_server" value="/tmp/ofhosts.csv" id="domainfile"/>
	<option type="ts_jabber" name="vhost_file" value="domainfile"/>
	<option name="seed" value="668852"/>
  </options>
  <sessions>
	<session probability="70" name="jabber-test-chat" type="ts_jabber" bidi="true">
	  <transaction name="chat1">
		<request> <jabber type="connect" ack="local" /> </request>
		<request> <jabber type="auth_get" ack="local"></jabber> </request>
		<request> <jabber type="auth_set_plain" ack="local"></jabber> </request>
		<request> <jabber type="presence:initial" ack="no_ack"/> </request>
	  </transaction>

		<thinktime value="1" random="false"></thinktime>
		<transaction name="chat2">
		  <for from="1" to="5" var="dummy">
	  		<request> <jabber type="chat" ack="no_ack" size="16" destination="online"/></request>
			<request> <jabber type="chat" ack="no_ack" size="16" destination="online"/></request>
			<request> <jabber type="chat" ack="no_ack" size="16" destination="online"/></request>
			<request> <jabber type="chat" ack="no_ack" size="16" destination="online"/></request>
		  </for>
		</transaction>
		<transaction name="chat3">
		  <request> <jabber type="chat" ack="no_ack" size="16" destination="online"/></request>
		  <request> <jabber type="chat" ack="no_ack" size="16" destination="offline"/></request>
		  <request> <jabber type="chat" ack="no_ack" size="16" destination="online"/></request>
		  <request> <jabber type="chat" ack="no_ack" size="16" destination="offline"/></request>
		  <request> <jabber type="close" ack="local"> </jabber></request>
		</transaction>
	</session>
	<session probability="30" name="jabber-test-roster" type="ts_jabber" bidi="true">
	  <transaction name="rosteraction">
      <request> <jabber type="connect" ack="local" /> </request>
      <thinktime value="1" random="false"></thinktime>
	  <request> <jabber type="auth_get" ack="local"></jabber> </request>
	  <request> <jabber type="auth_set_plain" ack="local"></jabber> </request>
      <request> <jabber type="presence:initial" ack="no_ack"/> </request>

      <thinktime value="1" random="false"></thinktime>

	  <request>
		<jabber type="iq:roster:add" ack="no_ack" destination="online"></jabber>
	  </request>
	  <request>
		<jabber type="presence:subscribe" ack="no_ack"/>
	  </request>
<!--      <thinktime min="1" max="2" random="true"></thinktime>-->
	  <request> <jabber type="iq:roster:rename" ack="no_ack"></jabber> </request>
<!--      <thinktime min="1" max="2" random="true"></thinktime>-->
	  <request> <jabber type="iq:roster:remove" ack="no_ack"></jabber> </request>
	  <request> <jabber type="close" ack="local"> </jabber></request>
      </transaction>
	</session>
  </sessions>
</tsung>